Revit 2027 API
ParameterTypeId.SteelElemWeldDoubleWeldprep Property
 "Double Weld preparation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldDoubleWeldprep { get; }
Public Shared ReadOnly Property SteelElemWeldDoubleWeldprep As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldDoubleWeldprep {
	ForgeTypeId^ get ();
}
static member SteelElemWeldDoubleWeldprep : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace